{"modelTopology": {"model_config": {"class_name": "Sequential", "config": {"name": "sequential_1", "layers": [{"class_name": "Model", "config": {"name": "vgg16", "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"name": "input_1", "batch_input_shape": [null, 224, 224, 3], "sparse": false, "dtype": "float32"}}, {"name": "block1_conv1", "class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block1_conv1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block1_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 64, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block1_conv2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block1_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "block1_pool", "pool_size": [2, 2], "data_format": "channels_last"}}, {"name": "block2_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block2_conv1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block2_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 128, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block2_conv2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block2_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "block2_pool", "pool_size": [2, 2], "data_format": "channels_last"}}, {"name": "block3_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block3_conv1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block3_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block3_conv2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block3_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 256, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block3_conv3", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block3_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "block3_pool", "pool_size": [2, 2], "data_format": "channels_last"}}, {"name": "block4_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block4_conv1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block4_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block4_conv2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block4_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block4_conv3", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block4_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "block4_pool", "pool_size": [2, 2], "data_format": "channels_last"}}, {"name": "block5_conv1", "class_name": "Conv2D", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block5_conv1", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block5_conv2", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block5_conv2", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block5_conv3", "class_name": "Conv2D", "inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "relu", "dilation_rate": [1, 1], "strides": [1, 1], "filters": 512, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "trainable": true, "name": "block5_conv3", "kernel_regularizer": null, "activity_regularizer": null, "kernel_constraint": null}}, {"name": "block5_pool", "class_name": "MaxPooling2D", "inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"strides": [2, 2], "padding": "valid", "trainable": true, "name": "block5_pool", "pool_size": [2, 2], "data_format": "channels_last"}}], "output_layers": [["block5_pool", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_1", "units": 32, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.0010000000474974513}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_2", "units": 16, "activity_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.0010000000474974513}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_regularizer": null, "activation": "sigmoid", "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "name": "dense_3", "units": 1, "activity_regularizer": null, "kernel_constraint": null}}]}}, "training_config": {"loss": "binary_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421}}, "sample_weight_mode": null, "metrics": ["acc"], "loss_weights": null}, "keras_version": "2.2.4", "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "weightsManifest": [{"paths": ["group1-shard1of15.bin", "group1-shard2of15.bin", "group1-shard3of15.bin", "group1-shard4of15.bin", "group1-shard5of15.bin", "group1-shard6of15.bin", "group1-shard7of15.bin", "group1-shard8of15.bin", "group1-shard9of15.bin", "group1-shard10of15.bin", "group1-shard11of15.bin", "group1-shard12of15.bin", "group1-shard13of15.bin", "group1-shard14of15.bin", "group1-shard15of15.bin"], "weights": [{"name": "dense_1/kernel", "shape": [25088, 32], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [32], "dtype": "float32"}, {"name": "dense_2/kernel", "shape": [32, 16], "dtype": "float32"}, {"name": "dense_2/bias", "shape": [16], "dtype": "float32"}, {"name": "dense_3/kernel", "shape": [16, 1], "dtype": "float32"}, {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}, {"name": "block1_conv1/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "block1_conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "block1_conv2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "block1_conv2/bias", "shape": [64], "dtype": "float32"}, {"name": "block2_conv1/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "block2_conv1/bias", "shape": [128], "dtype": "float32"}, {"name": "block2_conv2/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "block2_conv2/bias", "shape": [128], "dtype": "float32"}, {"name": "block3_conv1/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "block3_conv1/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv2/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv2/bias", "shape": [256], "dtype": "float32"}, {"name": "block3_conv3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "block3_conv3/bias", "shape": [256], "dtype": "float32"}, {"name": "block4_conv1/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "block4_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block4_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block4_conv3/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv1/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv2/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv2/bias", "shape": [512], "dtype": "float32"}, {"name": "block5_conv3/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "block5_conv3/bias", "shape": [512], "dtype": "float32"}]}], "convertedBy": "TensorFlow.js Converter v1.2.6", "format": "layers-model"}